# a = int(input())
# c = (5/9) * (a-32)

# print("%.3f" % c)
# print(round(c,3))

#----------------------------------------------

# 輸入會有三個值，第一個值是星期幾，第二個值是股票的單價，
# 第三個值是今日成交總量，每個值之間用一個空白隔開，
# 假設此股票在星期五、六、日是不開市的，所以如果是在這幾天，請回傳"不開市"


a = input()
b = a.split()

if b[0] == "星期一":
    print(int(b[1]) * int(b[2]))
elif b[0] == "星期二":
    print(int(b[1]) * int(b[2]))
elif b[0] == "星期三":
    print(int(b[1]) * int(b[2]))
elif b[0] == "星期四":
    print(int(b[1]) * int(b[2]))
elif b[0] == "星期五":
    print("不開市")
elif b[0] == "星期六":
    print("不開市")
elif b[0] == "星期日":
    print("不開市")